w7/d2/news-reader-master/skeleton/app/controllers/api/feeds_controller.rb

  def index
    render :json => Feed.all, include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 2]]
SELECT "feeds".* FROM "feeds"

  def destroy
    feed = Feed.find(params[:id])
    feed.destroy
    render :json => Feed.all, include: :latest_entries
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "7"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 7]]
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 7]]
SELECT "feeds".* FROM "feeds"